1. Учебное задание
Вычислите 2 в степени 1024

> 179769313486231590772930519078902473361797697894230657273430081157732675805500963132708477322407536021120113879871393357658789768814416622492847430639474124377767893424865485276302219601246094119453082952085005768838150682342462881473913110540827237163350510684586298239947245938479716304835356329624224137216

2. Учебное задание
Объем мирового океана, согласно Википедии, 1340.74 млн км³. Средняя плотность – 1.024 г/см³. Предположим, что в 1 тонне воды мирового океана содержится 0.005мг золота. Предположим, что из всего растворенного золота был выплавлен куб. Укажите размер его ребра в метрах (округлить до целого). Плотность золота – 19.32 г/см³.
Вычислите используя Python. Возможно, вам будет удобно использовать промежуточные переменные.

> 71

3. Учебное задание
sum(range(1, 10))
Вычисли сумму всех целых чисел, меньших 10:

> 45

4. Учебное задание
Попробуйте вычислить подобные суммы, меняя правую границу на 100, 1000, 10000. Есть ли в ответах какая-то закономерность?
Если вы попробуете вычислить sum(range(1, 1000000000000000000000)), ваш интерпретатор «зависнет», потому что нужно сделать слишком много вычислений. Тем не менее, напишите верный ответ.

> 499999999999999999999500000000000000000000
