1. Задание
Напишите команду запускающую отладчик Python в командной строке для файла debug.py на диске С.
  > python -m pdb C:/debug.py
    
    
2. Задание
Напишите команду запускающую отладчик в Python IDE PyCharm.
  > Shift + F9
  
  
3. Задание
С помощью Doctest напишите запуск и тестовый вывод для функции Fibonacci(n) вычисляющей 10 чисел Фибоначчи, которая на вход 
принимает количество чисел Фибоначчи, а на выход выдает строку десяти чисел Фибоначчи отделенных друг от друга запятой и пробелом.

Запуск функции Fibonacci(n) вычисляющей 10 чисел Фибоначчи:
  > Fibonacci(10)

Тестовый вывод функции Fibonacci(n) вычисляющей 10 чисел Фибоначчи:
  > 1,1,2,3,5,8,13,21,34,55
  
  
4. Задание
Напишите команду запускающую Doctest в командной строке с выводом результатов тестов Python в командной строке для файла test.py на диске D.
  > python -m doctest -v D:/test.py
    
    
5. Задание
Напишите команду запускающую профилизатор Python в командной строке для файла profile.py на диске С.
  > python -m cProfile C:/profile.py
    

6. Задание
Напишите номер строки, которая определяет пользовательскую функцию, выполняющуюся дольше всего.
  > 2
  
  
7. Задание
Написать доктесты для функции, вычисляющей для переданного аргумента x результат комбинации одной и той же функции fn, 
выполненной n раз. Весь код написан в файле main.py.
Выберите правильный вариант запуска кода из консоли:
  > python -m doctest -v main.py
